'''Задача 2: Найдите сумму цифр трехзначного числа.
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)'''

print('введите трехзначное число: ')
n = int(input())
a = n //100
b = n //10 % 10
c = n % 10
print(a + b +c)




